package pro.sky.animal_shelter_ji22_team1_app.constants;

public class EntryMenuTestConstants {

    public static final String ENTRY_WELCOME = "Приветствуем Ваше желание усыновить животное из приюта!" +
            " Для получения необходимой информации, пожалуйста, сообщите," +
            " какого питомца вы хотите выбрать:" +
            "\n/dog - собака;" +
            "\n/cat - кошка";

    public static final String DOG_WELCOME = "Чтобы усыновить собаку из приюта," +
            " Вам может понадобиться:" +
            "\n/dogs                - получить список собак для усыновления;" +
            "\n/documents           - получить список документов, необходимых для усыновления животного;" +
            "\n/transportation      - получить список рекомендаций по транспортировке животного;" +
            "\n/puppy_house         - получить список рекомендаций по обустройства дома для щенка;" +
            "\n/pet_house           - получить список рекомендаций по обустройства дома для взрослого животного;" +
            "\n/invalid_pet_house   - получить список рекомендаций по обустройства дома для животного с ограниченными возможностями;" +
            "\n/dog_handler         - получить советы кинолога по первичному обращению с собакой;" +
            "\n/dog_handler_list    - получить список проверенных кинологов;" +
            "\n/waiver_list         - узнать список возможных причин отказа в усыновлении животного" +
            "\n/dog_rules           - получить Правила знакомства с собакой;" +
            "\n/client_contacts     - сообщить свои контактные данные";

    public static final String CAT_WELCOME = "Приветствуем Ваше желание усыновить животное из приюта" +
            " и информируем о том, что для этого Вам может понадобиться:" +
            "\n/cats                - получить список кошек для усыновления;" +
            "\n/documents           - получить список документов, необходимых для усыновления животного;" +
            "\n/transportation      - получить список рекомендаций по транспортировке животного;" +
            "\n/pet_house           - получить список рекомендаций по обустройства дома для взрослого животного;" +
            "\n/invalid_pet_house   - получить список рекомендаций по обустройства дома для животного с ограниченными возможностями;" +
            "\n/waiver_list         - узнать список возможных причин отказа в усыновлении животного" +
            "\n/cat_rules           - получить Правила знакомства с кошкой;" +
            "\n/client_contacts     - сообщить свои контактные данные";


    public static final String DOGS_LIST = "[Имя животного: Полкан; возраст: 2; порода: дворняжка]";

    public static final String CATS_LIST = "[Имя животного: Мурка; возраст: 1; порода: цветная]";

    public static final String DOCUMENTS_LIST = "[<> Список документов для усыновления]";

    public static final String TRANSPORTATION_LIST = "[<> Список рекомендаций по транспортировке животного]";

    public static final String PET_HOUSE_LIST = "[<> Список рекомендаций по обустройству дома для взрослого животного]";

    public static final String INVALID_PET_HOUSE_LIST = "[<> Список рекомендаций по обустройству дома для животного с ограниченными возможностями]";

    public static final String WAIVER_LIST_LIST = "[<> Список возможных причин отказа в усыновлении животного]";

    public static final String DOG_RULES_LIST = "[<> Правила знакомства с животным (собака)]";

    public static final String PUPPY_HOUSE_LIST = "[<> Список рекомендаций по обустройству дома для щенка]";

    public static final String DOG_HANDLER_LIST = "[<> Советы кинолога по первичному обращению с собакой]";

    public static final String DOG_HANDLER_LIST_LIST = "[<> Список проверенных кинологов]";

    public static final String CAT_RULES_LIST = "[<> Правила знакомства с животным(кошка)]";


}
